__autor__ = 'Ruslan Bikmetov'

"""
Задача 3
Найдите сумму чисел n + nn + nnn
"""

n = int(input("Введите число n: "))
summa = n + n * 11 + n * 111
print(summa)
