__autor__ = 'Ruslan Bikmetov'

"""
Задача 1
запросите у пользователя несколько чисел и строк 
и сохраните в переменные, выведите на экран.
"""

string = input("Введите слово: ")
count = int(input("Введите число: "))
print(f'{string}, {count}')
